In [5]:
import numpy as np
import pandas as pd

In [6]:
df = pd.read_csv("train.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
df.drop(columns=["PassengerId", "Pclass", "Name", "Sex", "Age", "Fare", "Embarked"], inplace=True)

In [8]:
df.head(1)

   Survived  SibSp  Parch     Ticket Cabin
0         0      1      0  A/5 21171   NaN

In [9]:
df["Number"] = df["SibSp"] + df["Parch"]
df.head(1)

   Survived  SibSp  Parch     Ticket Cabin  Number
0         0      1      0  A/5 21171   NaN       1

In [10]:
df.drop(columns=["SibSp", "Parch"], inplace=True)
df.sample(10)

     Survived           Ticket Cabin  Number
405         0            28664   NaN       1
256         1         PC 17585   NaN       0
687         0           349228   NaN       0
392         0          3101277   NaN       2
471         0           315089   NaN       0
261         1           347077   NaN       6
86          0       W./C. 6608   NaN       4
827         1  S.C./PARIS 2079   NaN       2
600         1           243847   NaN       3
77          0           374746   NaN       0

In [11]:
df["Number"] = df["Number"].replace(0, "A")
df.head()

   Survived            Ticket Cabin Number
0         0         A/5 21171   NaN      1
1         1          PC 17599   C85      1
2         1  STON/O2. 3101282   NaN      A
3         1            113803  C123      1
4         0            373450   NaN      A

In [12]:
df["Number"].unique()

array([1, 'A', 4, 2, 6, 5, 3, 7, 10], dtype=object)

### Look we have mixed values now - numerical and categorical in a single column

Extracting Numerical Part

In [13]:
df["Number_numerical"] = pd.to_numeric(df["Number"], errors="coerce", downcast="integer")

In [14]:
df["Number_categorical"] = np.where(df["Number_numerical"].isnull(), df["Number"], np.nan)

# np.where(condition, x, y) returns an array with elements from x in a row where condition is True, and elements from y at other rows

# x = np.where(
#     1 > 2,
#     "yes correct",
#     "wrong"
# )
# x will be wrong

In [15]:
df.head()

,Survived,Ticket,Cabin,Number,Number_numerical,Number_categorical
0,0,A/5 21171,NaN,1,1.0,NaN
1,1,PC 17599,C85,1,1.0,NaN
2,1,STON/O2. 3101282,NaN,A,NaN,A
3,1,113803,C123,1,1.0,NaN
4,0,373450,NaN,A,NaN,A

### Number column is handled. Now lets handle at Cabin and Ticket

### Cabin

In [16]:
pd.DataFrame(df["Cabin"].unique())

        0
0     NaN
1     C85
2    C123
3     E46
4      G6
..    ...
143   E17
144   A24
145   C50
146   B42
147  C148

[148 rows x 1 columns]

Here you see that each value contains both numeric and categorical

Extracting numerical part of Cabin

In [17]:
df["Cabin_numerical"] = df["Cabin"].str.extract("(\\d+)")
df.sample(10)

,Survived,Ticket,Cabin,Number,Number_numerical,Number_categorical,Cabin_numerical
774,1,29105,NaN,4,4.0,NaN,NaN
693,0,2672,NaN,A,NaN,A,NaN
193,1,230080,F2,2,2.0,NaN,2
276,0,347073,NaN,A,NaN,A,NaN
386,0,CA 2144,NaN,7,7.0,NaN,NaN
830,1,2659,NaN,1,1.0,NaN,NaN
203,0,2628,NaN,A,NaN,A,NaN
334,1,PC 17611,NaN,1,1.0,NaN,NaN
580,1,237789,NaN,2,2.0,NaN,NaN
218,1,11813,D15,A,NaN,A,15

Extracting categorical part of Cabin

In [18]:
df["Cabin_categorical"] = df["Cabin"].str[0]
df.sample(10)

,Survived,Ticket,Cabin,Number,Number_numerical,Number_categorical,Cabin_numerical,Cabin_categorical
198,1,370370,NaN,A,NaN,A,NaN,NaN
207,1,2699,NaN,A,NaN,A,NaN,NaN
658,0,29751,NaN,A,NaN,A,NaN,NaN
176,0,4133,NaN,4,4.0,NaN,NaN,NaN
831,1,29106,NaN,2,2.0,NaN,NaN,NaN
187,1,111428,NaN,A,NaN,A,NaN,NaN
269,1,PC 17760,C99,A,NaN,A,99,C
697,1,35852,NaN,A,NaN,A,NaN,NaN
360,0,347088,NaN,5,5.0,NaN,NaN,NaN
124,0,35281,D26,1,1.0,NaN,26,D

### Now Ticket

In [19]:
pd.DataFrame(df["Ticket"].unique()).head()

                  0
0         A/5 21171
1          PC 17599
2  STON/O2. 3101282
3            113803
4            373450

Extracting the last bit of Ticket i.e the number

In [20]:
df["Ticket_numerical"] = df["Ticket"].apply(lambda s: s.split()[-1])

pd.DataFrame(df["Ticket_numerical"]).head()

  Ticket_numerical
0            21171
1            17599
2          3101282
3           113803
4           373450

In [21]:
df["Ticket_numerical"] = pd.to_numeric(df["Ticket_numerical"],
                                       errors="coerce",
                                       downcast="integer")

pd.DataFrame(df["Ticket_numerical"].head())

   Ticket_numerical
0           21171.0
1           17599.0
2         3101282.0
3          113803.0
4          373450.0

Extracting first part i.e. the letters

In [22]:
df["Ticket_categorical"] = df["Ticket"].apply(lambda s: s.split()[0])

pd.DataFrame(df["Ticket_categorical"]).head()

  Ticket_categorical
0                A/5
1                 PC
2           STON/O2.
3             113803
4             373450

Notice, in rows where there were no letters, the numbers only were considered as the first part so they got into the dataframe

In [23]:
df["Ticket_categorical"] = np.where(df["Ticket_categorical"].str.isdigit(), np.nan, df["Ticket_categorical"])

pd.DataFrame(df["Ticket_categorical"]).head()

  Ticket_categorical
0                A/5
1                 PC
2           STON/O2.
3                NaN
4                NaN